ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_uart.h
/***************************************************************************//**
* \file cy_scb_uart.h
* \version 1.0
*
* Provides UART API declarations of the SCB driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

/**
* \addtogroup group_scb_uart
* \{
* Driver API for UART
*
* UART - Universal Synchronous/Asynchronous Receiver/Transmitter,
* commonly referred to as RS-232.
*
* Three different UART-like serial interface protocols are supported:
* * UART - the standard mode with an optional UART Hardware flow control.
* * SmartCard - the transfer is similar to the UART transfer,
*   but a NACK (negative acknowledgment) may be sent from the
*   receiver to the transmitter. Both transmitter and receiver drive the same
*   line, although never at the same time.
* * IrDA - the Infra-red Data Association protocol adds a modulation
*   scheme to the UART signaling. At the transmitter, bits are modulated.
*   At the receiver, bits are demodulated. The modulation scheme uses the
*   Return-to-Zero-Inverted (RZI) format. Bit value "0" is signaled by a
*   short "1" pulse on the line and bit value "1" is signaled by holding
*   the line to "0".
*
* \section group_scb_uart_configuration Configuration Considerations
*
* To set up a UART, provide configuration parameters in the
* \ref cy_stc_scb_uart_config_t structure. For example: provide uartMode,
* overSample, dataWidth, enableMsbFirst, parity, and stopBits. The other
* parameters are optional for operation.
* To initialize the driver, call the \ref Cy_SCB_UART_Init function providing
* filled \ref cy_stc_scb_uart_config_t structure and allocated
* \ref cy_stc_scb_uart_context_t.
* The clock source connected to SCB UART must be configured to provide
* the sufficient frequency and set the appropriate oversampling to reach the
* desired data.
* Call \ref Cy_SCB_UART_Enable to start the UART operation after configuration
* is completed.
*
* The UART API is divided into two categories: low-level and high-level.
* Do not mix high-level and low-level API because low-level APIs can adversely
* affect the operation of higher level API.
*
* The low-level API's functions allow interacting directly with the hardware
* and do not use interrupts. These functions do not require context for
* operation, thus NULL can be passed in \ref Cy_SCB_UART_Init and
* \ref Cy_SCB_UART_Disable instead of a pointer to the context structure.
*
* * To write data into the TX FIFO, use one of the provided functions:
*   \ref Cy_SCB_UART_Put, \ref Cy_SCB_UART_PutArray,
*   \ref Cy_SCB_UART_PutArrayBlocking or \ref Cy_SCB_UART_PutString.
*   Note that putting data into the TX FIFO starts data transfer.
*
* * To read data from the RX FIFO, use one of the provided functions:
*   \ref Cy_SCB_UART_Get, \ref Cy_SCB_UART_GetArray or
*   \ref Cy_SCB_UART_GetArrayBlocking.
*
* * The statuses can be polled by using: \ref Cy_SCB_UART_GetRxFifoStatus and
*   \ref Cy_SCB_UART_GetTxFifoStatus.
*   The statuses are W1C (Write 1 to Clear) and after status is set it must
*   be cleared. Note that there are statuses that are evaluated as level. These
*   statuses remain set when an event is true. Therefore after clear operation
*   the status is cleared but then restored (if event is true).
*   For example: the TX FIFO empty can be cleared when the TX FIFO is
*   NOT empty. You have to put at least (two data elements, one goes to shifter
*   and next in FIFO) before clearing this status.
*
* The High Level API uses an interrupt to execute transfer. Call
* \ref Cy_SCB_UART_Transmit to start transmission. Call \ref Cy_SCB_UART_Receive
* to start receive operation. After the operation is started the
* \ref Cy_SCB_UART_Interrupt handles the data transfer until its
* completion. Therefore \ref Cy_SCB_UART_Interrupt must be called inside the
* user interrupt handler to make the high level API work. To monitor status
* of transmit operation, use \ref Cy_SCB_UART_GetTransmitStatus and
* \ref Cy_SCB_UART_GetReceiveStatus to monitor receive status appropriately.
* Alternatively use \ref Cy_SCB_UART_RegisterCallback to register callback
* function to be notified about \ref group_scb_uart_macro_callback_events.
*
* There is also capability to insert a receive ring buffer that operates between
* the RX FIFO and the user buffer. The received data is copied into the ring
* buffer from the RX FIFO. This process runs in the background after the ring
* buffer operation is started by \ref Cy_SCB_UART_StartRingBuffer.
* When \ref Cy_SCB_UART_Receive is called, it first reads data from the ring
* buffer and then sets up an interrupt to receive more data if the required
* amount has not been read yet.
*
* \section group_scb_uart_more_information More Information
*
* For more information on the SCB peripheral, refer to the technical reference
* manual (TRM).
*
* \section group_scb_uart_MISRA MISRA-C Compliance
* <table class="doxtable">
*   <tr>
*     <th>MISRA Rule</th>
*     <th>Rule Class (Required/Advisory)</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>11.4</td>
*     <td>A</td>
*     <td>A cast should not be performed between a pointer to object type and
*         a different pointer to object type.</td>
*     <td>The pointer to the buffer memory is void to allow handling different
*         different data types: uint8_t (4-8 bits) or uint16_t (9-16 bits).
*         </td>
*   </tr>
*   <tr>
*     <td>14.2</td>
*     <td>R</td>
*     <td>All non-null statements shall either: a) have at least one side-effect
*         however executed, or b) cause control flow to change.</td>
*     <td>The unused function parameters are cast to void. This statement
*         has no side-effect and is used to suppress a compiler warning.</td>
*   </tr>
*   <tr>
*     <td>20.3</td>
*     <td>R</td>
*     <td>The validity of values passed to library functions shall be checked.
*     </td>
*     <td>The CY_ASSERT() macro is used for verification of pointer to context
*         parameter against NULL. This macro halts code execution if
*         verification fails what ensures that NULL pointer is not dereference.
*     </td>
*   </tr>
* </table>
*
* \section group_scb_uart_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_scb_uart_macro Macro
* \defgroup group_scb_uart_functions Functions
* \defgroup group_scb_uart_data_structures Data Structures
* \defgroup group_scb_uart_enums Enumerated Types
*/

#if !defined(CY_SCB_UART_H)
#define CY_SCB_UART_H

#include "cy_scb_common.h"

#if defined(__cplusplus)
extern "C" {
#endif

