ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_uart.h
/***************************************
*          Enumerated Types
***************************************/

/**
* \addtogroup group_scb_uart_enums
* \{
*/

/** UART status codes */
typedef enum
{
    /** Operation completed successfully */
    CY_SCB_UART_SUCCESS = 0x00U,

    /** One or more of input parameters are invalid */
    CY_SCB_UART_BAD_PARAM = CY_SCB_ID | CY_PDL_STATUS_ERROR | CY_SCB_UART_ID | 1UL,

    /**
    * The UART is busy processing a transmit operation. Call this function
    * again once that operation is completed or aborted.
    */
    CY_SCB_UART_RECEIVE_BUSY,

    /**
    * The UART is busy processing a receive operation. Call this function
    * again once that operation is completed or aborted.
    */
    CY_SCB_UART_TRANSMIT_BUSY
} cy_en_scb_uart_status_t;
/** \} group_scb_uart_enums */


/***************************************
*       Type Definitions
***************************************/

/**
* \addtogroup group_scb_uart_data_structures
* \{
*/

/**
* Provides the typedef for the callback function called in the
* \ref Cy_SCB_UART_Interrupt to notify the user about occurrences of
* \ref group_scb_uart_macro_callback_events.
*/
typedef void (* scb_uart_handle_events_t)(uint32_t event);

/** UART configuration structure */
typedef struct stc_scb_uart_config
{
    /** Specifies the UART's mode of operation
    * (See \ref group_scb_uart_macro_modes for the set of constants)
    */
    uint32_t    uartMode;

    /**
    * Oversample factor for UART.
    * * The UART baud rate is the SCB Clock frequency / oversample
    *  (valid range is 8-16).
    * * For IrDA, the oversample is always 16, unless
    * \ref irdaEnableLowPowerReceiver is enabled. Then the oversample is
    * reduced to the \ref group_scb_uart_macro_irda_lp_ovs set.
    */
    uint32_t    oversample;

    /** The width of UART data (valid range is 5 to 9) */
    uint32_t    dataWidth;

    /**
    * Enables the hardware to shift out data element MSB first, otherwise,
    * LSB first
    */
    bool        enableMsbFirst;

    /**
    * Specifies the number of stop bits in the UART transaction, in half-bit
    * increments (See \ref group_scb_uart_macro_stop_bits for the set of
    * constants.)
    */
    uint32_t    stopBits;

    /** Configures the UART parity
    * (See \ref group_scb_uart_macro_parity for the set of constants.)
    */
    uint32_t    parity;

    /**
    * Enables a digital 3-tap median filter to be applied to the input
    * of the RX FIFO to filter glitches on the line
    */
    bool        enableInputFilter;

    /**
    * Enables the hardware to drop data in the RX FIFO when a parity error is
    * detected
    */
    bool        dropOnParityError;

    /**
    * Enables the hardware to drop data in the RX FIFO when a frame error is
    * detected
    */
    bool        dropOnFrameError;

    /**
    * Enables the UART operation in Multi-Processor mode which requires
    * dataWidth to be 9 bits (the 9th bit is used to indicate address byte)
    */
    bool        enableMutliProcessorMode;

    /**
    * If Multi Processor mode is enabled, this is the address of the RX
    * FIFO. If the address matches, data is accepted into the FIFO. If
    * it does not match, the data is ignored.
    */
    uint32_t    receiverAddress;

    /** This is the address mask for the Multi Processor address. 1 indicates
    * that the incoming address must match the corresponding bit in the slave
    * address. A 0 in the mask indicates that the incoming address does
    * not need to match.
    */
    uint32_t    receiverAddressMask;

    /**
    * Enables the hardware to accept the matching address in the RX FIFO.
    * This is useful when the device supports more than one address.
    */
    bool        acceptAddrInFifo;

    /** Inverts the IrDA RX input */
    bool        irdaInvertRx;

    /**
    * Enables the low-power receive for IrDA mode.
    * Note that the transmission must be disabled if this mode is enabled.
    */
    bool        irdaEnableLowPowerReceiver;

    /**
    * Enables retransmission of the frame placed in the TX FIFO when
    * NACK is received in SmartCard mode
    */
    bool        smartCardRetryOnNack;

    /**
    * Enables the usage of the CTS input signal for the transmitter. The
    * transmitter waits for CTS to be active before sending data
    */
    bool        enableCts;

    /** Sets the CTS Polarity
    * (See \ref group_scb_uart_macro_polarity for the set of constants.)
    */
    uint32_t    ctsPolarity;

    /**
    * When the RX FIFO has fewer entries than rtsRxFifoLevel, the
    * RTS signal is active (note to disable RTS, set this field to zero)
    */
    uint32_t    rtsRxFifoLevel;

    /** Sets the RTS Polarity
    * (See \ref group_scb_uart_macro_polarity for the set of constants.)
    */
    uint32_t    rtsPolarity;

    /** Specifies the number of bits to detect a break condition */
    uint32_t    breakWidth;

    /**
    * When there are more entries in the RX FIFO than this level
    * the RX trigger output goes high. This output can be connected
    * to a DMA channel through a trigger mux.
    * Also, it controls the \ref CY_SCB_UART_RX_TRIGGER interrupt source.
    */
    uint32_t    rxFifoTriggerLevel;

    /**
    * The bits set in this mask allow the event to cause an interrupt
    * (See \ref group_scb_uart_macro_rx_fifo_status for the set of constants.)
    */
    uint32_t    rxFifoIntEnableMask;

    /**
    * When there are fewer entries in the TX FIFO then this level
    * the TX trigger output goes high. This output can be connected
    * to a DMA channel through a trigger mux.
    * Also it controls \ref CY_SCB_UART_TX_TRIGGER interrupt source.
    */
    uint32_t    txFifoTriggerLevel;

    /**
    * Bits set in this mask allows the event to cause an interrupt
    * (See \ref group_scb_uart_macro_tx_fifo_status for the set of constants)
    */
    uint32_t    txFifoIntEnableMask;


} cy_stc_scb_uart_config_t;

/** UART internal context structure */
typedef struct cy_stc_scb_uart_context
{
    uint32_t volatile txStatus;         /**< Transmit status */
    uint32_t volatile rxStatus;         /**< Receive status */

    void *rxRingBuf;                    /**< Pointer to ring buffer */
    uint32_t volatile rxRingBufSize;    /**< Ring buffer size */
    uint32_t volatile rxRingBufHead;    /**< Ring buffer head index */
    uint32_t volatile rxRingBufTail;    /**< Ring buffer tail index */

    void *rxBuf;                        /**< Pointer to receive buffer */
    uint32_t volatile rxBufSize;        /**< Receive buffer size */
    uint32_t volatile rxBufIdx;         /**< Index within receive buffer */

