ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_uart.h
    void *txBuf;                        /**< Pointer to transmit buffer */
    uint32_t volatile txBufSize;        /**< Transmit buffer size */
    uint32_t volatile txLeftToTransmit; /**< Number of data elements left to be transmitted */

    /**
    * The pointer to an event callback which is called when a UART event occurs
    */
    scb_uart_handle_events_t cbEvents;

#if !defined(NDEBUG)
    uint32_t initKey;               /**< Tracks context initialization */
#endif /* !(NDEBUG) */
} cy_stc_scb_uart_context_t;
/** \} group_scb_uart_data_structures */


/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_scb_uart_functions
* \{
*/

/* Basic functions */
cy_en_scb_uart_status_t Cy_SCB_UART_Init(CySCB_Type *base, cy_stc_scb_uart_config_t const *config,
                                         cy_stc_scb_uart_context_t *context);
void     Cy_SCB_UART_DeInit (CySCB_Type *base);
__STATIC_INLINE void Cy_SCB_UART_Enable(CySCB_Type *base);
void     Cy_SCB_UART_Disable(CySCB_Type *base, cy_stc_scb_uart_context_t *context);

/* Configuration functions */
__STATIC_INLINE void     Cy_SCB_UART_EnableCts      (CySCB_Type *base);
__STATIC_INLINE void     Cy_SCB_UART_DisableCts     (CySCB_Type *base);
__STATIC_INLINE void     Cy_SCB_UART_SetRtsFifoLevel(CySCB_Type *base, uint32_t rxFifoLevel);
__STATIC_INLINE uint32_t Cy_SCB_UART_GetRtsFifoLevel(CySCB_Type const *base);

__STATIC_INLINE void     Cy_SCB_UART_EnableSkipStart (CySCB_Type *base);
__STATIC_INLINE void     Cy_SCB_UART_DisableSkipStart(CySCB_Type *base);

/* Low-level: RX direction functions */
__STATIC_INLINE uint32_t Cy_SCB_UART_Get             (CySCB_Type const *base);
__STATIC_INLINE uint32_t Cy_SCB_UART_GetArray        (CySCB_Type const *base, void *rxBuf, uint32_t size);
__STATIC_INLINE void     Cy_SCB_UART_GetArrayBlocking(CySCB_Type const *base, void *rxBuf, uint32_t size);

__STATIC_INLINE uint32_t Cy_SCB_UART_GetRxFifoStatus  (CySCB_Type const *base);
__STATIC_INLINE void     Cy_SCB_UART_ClearRxFifoStatus(CySCB_Type *base, uint32_t clearMask);
__STATIC_INLINE uint32_t Cy_SCB_UART_GetNumInRxFifo   (CySCB_Type const *base);
__STATIC_INLINE void     Cy_SCB_UART_ClearRxFifo      (CySCB_Type *base);

/* Low-level: TX direction functions */
__STATIC_INLINE uint32_t Cy_SCB_UART_Put             (CySCB_Type *base, uint32_t data);
__STATIC_INLINE uint32_t Cy_SCB_UART_PutArray        (CySCB_Type *base, void *txBuf, uint32_t size);
__STATIC_INLINE void     Cy_SCB_UART_PutArrayBlocking(CySCB_Type *base, void *txBuf, uint32_t size);
__STATIC_INLINE void     Cy_SCB_UART_PutString       (CySCB_Type *base, char_t const string[]);

__STATIC_INLINE uint32_t Cy_SCB_UART_GetTxFifoStatus  (CySCB_Type const *base);
__STATIC_INLINE void     Cy_SCB_UART_ClearTxFifoStatus(CySCB_Type *base, uint32_t clearMask);
__STATIC_INLINE uint32_t Cy_SCB_UART_GetNumInTxFifo   (CySCB_Type const *base);
__STATIC_INLINE bool     Cy_SCB_UART_IsTxComplete     (CySCB_Type const *base);
__STATIC_INLINE void     Cy_SCB_UART_ClearTxFifo      (CySCB_Type *base);

/* High-level: Callback */
__STATIC_INLINE void Cy_SCB_UART_RegisterCallback(CySCB_Type const *base, scb_uart_handle_events_t callback,
                                                  cy_stc_scb_uart_context_t *context);

/* High-level: Ring buffer functions */
void     Cy_SCB_UART_StartRingBuffer   (CySCB_Type *base, void* ringBuffer, uint32_t size,
                                        cy_stc_scb_uart_context_t *context);
void     Cy_SCB_UART_StopRingBuffer    (CySCB_Type *base, cy_stc_scb_uart_context_t *context);
uint32_t Cy_SCB_UART_GetNumInRingBuffer(CySCB_Type const *base, cy_stc_scb_uart_context_t const *context);
void     Cy_SCB_UART_ClearRingBuffer   (CySCB_Type const *base, cy_stc_scb_uart_context_t *context);

/* High-level: RX direction functions */
cy_en_scb_uart_status_t Cy_SCB_UART_Receive(CySCB_Type *base, void *rxBuf, uint32_t size, cy_stc_scb_uart_context_t *context);
void     Cy_SCB_UART_AbortReceive    (CySCB_Type *base, cy_stc_scb_uart_context_t *context);
uint32_t Cy_SCB_UART_GetNumReceived  (CySCB_Type const *base, cy_stc_scb_uart_context_t const *context);
uint32_t Cy_SCB_UART_GetReceiveStatus(CySCB_Type const *base, cy_stc_scb_uart_context_t const *context);

/* High-level: TX direction functions */
cy_en_scb_uart_status_t Cy_SCB_UART_Transmit(CySCB_Type *base, void *txBuf, uint32_t size, cy_stc_scb_uart_context_t *context);
void     Cy_SCB_UART_AbortTransmit       (CySCB_Type *base, cy_stc_scb_uart_context_t *context);
uint32_t Cy_SCB_UART_GetNumLeftToTransmit(CySCB_Type const *base, cy_stc_scb_uart_context_t const *context);
uint32_t Cy_SCB_UART_GetTransmitStatus   (CySCB_Type const *base, cy_stc_scb_uart_context_t const *context);

/* High-level: Interrupt handler */
void Cy_SCB_UART_Interrupt(CySCB_Type *base, cy_stc_scb_uart_context_t *context);
/** \} group_scb_uart_functions */


/***************************************
*            API Constants
***************************************/

/**
* \addtogroup group_scb_uart_macro
* \{
*/

/**
* \defgroup group_scb_uart_macro_modes UART Mode Defines
* \{
*/
/** Configures the SCB for Standard UART operation */
#define CY_SCB_UART_STANDARD   (0UL)

/** Configures the SCB for SmartCard operation */
#define CY_SCB_UART_SMARTCARD  (1UL)

/** Configures the SCB for IrDA operation */
#define CY_SCB_UART_IRDA       (2UL)
/** \} group_scb_uart_macro_modes */

/**
* \defgroup group_scb_uart_macro_stop_bits UART Stop Bit Defines
* \{
*/
#define CY_SCB_UART_STOP_BITS_1        (2UL)    /**< UART looks for 1 Stop Bit    */
#define CY_SCB_UART_STOP_BITS_1_5      (3UL)    /**< UART looks for 1.5 Stop Bits */
#define CY_SCB_UART_STOP_BITS_2        (4UL)    /**< UART looks for 2 Stop Bits   */
#define CY_SCB_UART_STOP_BITS_2_5      (5UL)    /**< UART looks for 2.5 Stop Bits */
#define CY_SCB_UART_STOP_BITS_3        (6UL)    /**< UART looks for 3 Stop Bits   */
#define CY_SCB_UART_STOP_BITS_3_5      (7UL)    /**< UART looks for 3.5 Stop Bits */
#define CY_SCB_UART_STOP_BITS_4        (8UL)    /**< UART looks for 4 Stop Bits   */
/** \} group_scb_uart_macro_stop_bits */

/**
* \defgroup group_scb_uart_macro_parity UART Parity Defines
* \{
*/
#define CY_SCB_UART_PARITY_NONE        (0UL)    /**< UART has no parity check   */
#define CY_SCB_UART_PARITY_EVEN        (2UL)    /**< UART has even parity check */
#define CY_SCB_UART_PARITY_ODD         (3UL)    /**< UART has odd parity check  */
/** \} group_scb_uart_macro_parity */

/**
* \defgroup group_scb_uart_macro_irda_lp_ovs UART IRDA Low Power Oversample factors
* \{
*/
#define CY_SCB_UART_IRDA_LP_OVS16      (1UL)   /**< IrDA in low-power mode oversampled by 16   */
#define CY_SCB_UART_IRDA_LP_OVS32      (2UL)   /**< IrDA in low-power mode oversampled by 32   */
#define CY_SCB_UART_IRDA_LP_OVS48      (3UL)   /**< IrDA in low-power mode oversampled by 48   */
#define CY_SCB_UART_IRDA_LP_OVS96      (4UL)   /**< IrDA in low-power mode oversampled by 96   */
#define CY_SCB_UART_IRDA_LP_OVS192     (5UL)   /**< IrDA in low-power mode oversampled by 192  */
#define CY_SCB_UART_IRDA_LP_OVS768     (6UL)   /**< IrDA in low-power mode oversampled by 768  */
#define CY_SCB_UART_IRDA_LP_OVS1536    (7UL)   /**< IrDA in low-power mode oversampled by 1536 */
/** \} group_scb_uart_macro_irda_lp_ovs */

/**
* \defgroup group_scb_uart_macro_polarity UART Polarity Defines
* \{
*/
#define CY_SCB_UART_ACTIVE_LOW         (0UL)   /**< Signal is active low */
#define CY_SCB_UART_ACTIVE_HIGH        (1UL)   /**< Signal is active high */
/** \} group_scb_uart_macro_polarity */

/**
* \defgroup group_scb_uart_macro_rx_fifo_status UART Receive FIFO status.
* \{
*/
/** The number of entries in the RX FIFO is more than the RX FIFO trigger level
* value
*/
#define CY_SCB_UART_RX_TRIGGER         (SCB_INTR_RX_TRIGGER_Msk)

/** The RX FIFO is not empty, there is data to read */
#define CY_SCB_UART_RX_NOT_EMPTY       (SCB_INTR_RX_NOT_EMPTY_Msk)

/**
* The RX FIFO is full, there is no more space for additional data,
* any additional data will be dropped
*/
#define CY_SCB_UART_RX_FULL            (SCB_INTR_RX_FULL_Msk)

/**
* The RX FIFO was full and there was an attempt to write to it.
* That additional data was dropped.
*/
#define CY_SCB_UART_RX_OVERFLOW        (SCB_INTR_RX_OVERFLOW_Msk)

/** An attempt to read from an empty RX FIFO */
#define CY_SCB_UART_RX_UNDERFLOW       (SCB_INTR_RX_UNDERFLOW_Msk)

/** The RX FIFO detected a frame error, either a stop or stop-bit error */
#define CY_SCB_UART_RX_ERR_FRAME       (SCB_INTR_RX_FRAME_ERROR_Msk)

/** The RX FIFO detected a parity error */
#define CY_SCB_UART_RX_ERR_PARITY      (SCB_INTR_RX_PARITY_ERROR_Msk)

/** The RX FIFO detected a break transmission from the transmitter */
#define CY_SCB_UART_RX_BREAK_DETECT    (SCB_INTR_RX_BREAK_DETECT_Msk)
/** \} group_scb_uart_macro_rx_fifo_status */

/**
* \defgroup group_scb_uart_macro_tx_fifo_status UART TX FIFO Statuses
* \{
*/
/** The number of entries in the TX FIFO is less than the TX FIFO trigger level
* value
*/
#define CY_SCB_UART_TX_TRIGGER     (SCB_INTR_TX_TRIGGER_Msk)

/** The TX FIFO is not full, there is a space for more data */
#define CY_SCB_UART_TX_NOT_FULL    (SCB_INTR_TX_NOT_FULL_Msk)

